# 데이터프레임의 데이터 조작

In [2]:
import numpy as np
import pandas as pd

### 데이터의 갯수 세기

In [3]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count()

9

In [17]:
np.random.seed(2020)
df = pd.DataFrame(np.random.randint(5,size=(4,4)),dtype=float)
df.iloc[2,3]=np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
2  0.0  0.0  2.0  NaN
3  3.0  3.0  2.0  3.0

In [7]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [13]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 카테고리 값 세기

In [14]:
np.random.seed(2020)
s2 = pd.Series(np.random.randint(6,size=100))
s2.tail()

95    5
96    5
97    5
98    2
99    2
dtype: int32

In [15]:
s2.value_counts()

0    20
3    18
2    17
1    17
5    16
4    12
dtype: int64

In [19]:
df[0].value_counts()

3.0    2
0.0    2
Name: 0, dtype: int64

In [20]:
s2.value_counts().sort_index()

0    20
1    17
2    17
3    18
4    12
5    16
dtype: int64

In [21]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [22]:
s.sort_values()[::-1]

3    NaN
9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
dtype: float64

In [23]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [24]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  3.0
2  0.0  0.0  2.0  NaN
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

In [25]:
df.sort_values(by=[1,2])

     0    1    2    3
2  0.0  0.0  2.0  NaN
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

In [28]:
titanic["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [29]:
titanic["age"].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [30]:
titanic["class"].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [31]:
titanic["alive"].value_counts()

no     549
yes    342
Name: alive, dtype: int64

### 행/열 합계

In [34]:
np.random.seed(2020)
df2 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  0  8  3  6  3  3  7  8
1  0  0  8  9  3  7  2  3
2  6  5  0  4  8  6  4  1
3  1  5  9  5  6  6  6  5

In [35]:
df2.sum(axis=1)

0    38
1    32
2    34
3    43
dtype: int64

In [36]:
df2.sum(axis=0)

0     7
1    18
2    20
3    24
4    20
5    22
6    19
7    17
dtype: int64

In [37]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  0  8  3  6  3  3  7  8      38
1  0  0  8  9  3  7  2  3      32
2  6  5  0  4  8  6  4  1      34
3  1  5  9  5  6  6  6  5      43

In [38]:
df2.loc["ColTotal",:] = df2.sum()
df2

            0     1     2     3     4     5     6     7  RowSum
0         0.0   8.0   3.0   6.0   3.0   3.0   7.0   8.0    38.0
1         0.0   0.0   8.0   9.0   3.0   7.0   2.0   3.0    32.0
2         6.0   5.0   0.0   4.0   8.0   6.0   4.0   1.0    34.0
3         1.0   5.0   9.0   5.0   6.0   6.0   6.0   5.0    43.0
ColTotal  7.0  18.0  20.0  24.0  20.0  22.0  19.0  17.0   147.0

In [125]:
titanic["age"].mean()

29.69911764705882

In [92]:
round(titanic[titanic['sex']=='female'].age.mean(),2)

27.92

In [77]:
(titanic[titanic["sex"] == "female"])["age"].mean()

27.915708812260537

In [94]:
titanic[(titanic['pclass'] == 1) & (titanic['sex'] =='female')].age.mean()

34.61176470588235

In [128]:
titanic[:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [126]:
titanic["category1"] = titanic.apply(lambda r:r.sex if r["age"] >= 20 else "child",axis=1)
titanic.category1

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887     child
888     child
889      male
890      male
Name: category1, Length: 891, dtype: object

In [191]:

titanic.age = titanic.age.fillna(titanic.age.mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [130]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [153]:
titanic["category2"] = titanic.apply(lambda r:f"{r.sex}{r['age']}",axis=1)

In [143]:
titanic["category2"]

0        male22.0
1      female38.0
2      female26.0
3      female35.0
4        male35.0
          ...
886      male27.0
887    female19.0
888     femalenan
889      male26.0
890      male32.0
Name: category2, Length: 891, dtype: object

In [154]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 장년, 미성년자, 중년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [155]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [156]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [157]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [158]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [159]:
data = np.random.randn(1000)
cats = pd.qcut(data,4,labels=["Q1","Q2","Q3","Q4"])
cats

[Q2, Q1, Q4, Q2, Q3, ..., Q1, Q3, Q3, Q1, Q2]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [160]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

In [192]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["age_cat"] = pd.cut(titanic.age, bins, labels=labels)
titanic["age_cat"]

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age_cat, Length: 891, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [214]:
titanic["age_cat"].count()

877

In [233]:
titanic.age_cat[titanic.age_cat == "청년"].count()

407

In [269]:
titanic.age_cat.value_counts()

청년      407
중년      241
미성년자    165
장년       59
노년        5
Name: age_cat, dtype: int64

In [273]:
k = titanic.age_cat.value_counts()/titanic["age_cat"].count()
k

청년      0.464082
중년      0.274800
미성년자    0.188141
장년      0.067275
노년      0.005701
Name: age_cat, dtype: float64

In [274]:
a = 0
for i in k:
    a+=i
a

1.0

In [290]:
titanic["category3"] = titanic.apply(lambda r:"미성연자" if r["age"] < 20 else f'{r["age_cat"]}{"남성"if r.sex == "male" else "여성"}',axis=1)
titanic["category3"]

0      청년남성
1      중년여성
2      청년여성
3      중년여성
4      중년남성
       ...
886    청년남성
887    미성연자
888    청년여성
889    청년남성
890    중년남성
Name: category3, Length: 891, dtype: object

### 문제1

In [ ]:
population